OFtutorialTest01_cvd/testCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	INLET
	{
		type            fixedValue;
		value           uniform (-0.1 0 0);
	}

    WALL1
    {
        type            noSlip;
    }
	
	WALL2
    {
        type            noSlip;
    }

	BOTTOM
    {
        type            noSlip;
    }

	OUTLET
	{
		type 			zeroGradient;
	}

    SYS1
    {
        type            zeroGradient;
    }
	
    SYS2
    {
        type            zeroGradient;
    }	

    SYS3
    {
        type            zeroGradient;
    }	
	
}

// ************************************************************************* //
