OFtutorialTest01_cvd/testCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	INLET
	{
		type            zeroGradient;
	}

    WALL1
    {
        type            zeroGradient;
    }
	
    WALL2
    {
        type            zeroGradient;
    }	
	
    WALL3
    {
        type            zeroGradient;
    }	

    BOTTOM
    {
        type            zeroGradient;
    }		

	OUTLET
	{
		type            fixedValue;
		value			uniform 0;
	}

    SYS1
    {
        type            zeroGradient;
    }
	
    SYS2
    {
        type            zeroGradient;
    }	

    SYS3
    {
        type            zeroGradient;
    }	
}

// ************************************************************************* //
