OFtutorialTest01_cvd/testCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ddtSchemes
// {
//     default         Euler;
// }

// gradSchemes
// {
//     default         Gauss linear;
//     grad(p)         Gauss linear;
// }

// divSchemes
// {
//     default         Gauss linear;
//     div(phi,U)      Gauss linear;
// }

// laplacianSchemes
// {
//     default         Gauss linear orthogonal;
// }

// interpolationSchemes
// {
//     default         linear;
// }

// snGradSchemes
// {
//     default         orthogonal;
// }

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinearV 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
